cnlohr/ch32v003fun/ch32fun/ch32fun.c
// Mixture of embedlibc, and ch32v00x_startup.c
// Use with newlib headers.
// Mixture of weblibc, mini-printf and ???
/* This file contains the following functions:

// libc (via musl) mixture and miniprintf

int printf( const char* format, ... )
int vprintf(const char* format, va_list args)
int snprintf( char * buffer, unsigned int buffer_len, const char* format, ... )
int sprintf( char * buffer, const char * format, ... )
size_t wcrtomb(char *restrict s, wchar_t wc, mbstate_t *restrict st)
int wctomb(char *s, wchar_t wc)
size_t strlen(const char *s)
size_t strnlen(const char *s, size_t n)
void *memset(void *dest, int c, size_t n)
char *strcpy(char *d, const char *s)
char *strncpy(char *d, const char *s, size_t n)
int strcmp(const char *l, const char *r)
int strncmp(const char *_l, const char *_r, size_t n)
static char *twobyte_strstr(const unsigned char *h, const unsigned char *n)
static char *threebyte_strstr(const unsigned char *h, const unsigned char *n)
static char *fourbyte_strstr(const unsigned char *h, const unsigned char *n)
static char *twoway_strstr(const unsigned char *h, const unsigned char *n)
char *strstr(const char *h, const char *n)
char *strchr(const char *s, int c)
void *__memrchr(const void *m, int c, size_t n)
char *strrchr(const char *s, int c)
void *memcpy(void *dest, const void *src, size_t n)
int memcmp(const void *vl, const void *vr, size_t n)
void *memmove(void *dest, const void *src, size_t n)
void *memchr(const void *src, int c, size_t n)
int puts(const char *s)
int mini_itoa(long value, unsigned int radix, int uppercase, int unsig,
	 char *buffer)
int mini_vsnprintf(char *buffer, unsigned int buffer_len, const char *fmt, va_list va)
int mini_vpprintf(int (*puts)(char* s, int len, void* buf), void* buf, const char *fmt, va_list va)
int mini_snprintf(char* buffer, unsigned int buffer_len, const char *fmt, ...)
int mini_pprintf(int (*puts)(char*s, int len, void* buf), void* buf, const char *fmt, ...)

// IRQ Handling Code
void DefaultIRQHandler( void )
void NMI_RCC_CSS_IRQHandler( void )

// Startup Code
void InterruptVectorDefault( void )
void handle_reset( void )

// Configuration-specific I/O

#if defined( FUNCONF_USE_UARTPRINTF ) && FUNCONF_USE_UARTPRINTF
void SetupUART( int uartBRR )
int _write(int fd, const char *buf, int size)
int putchar(int c)
#endif

#if defined( FUNCONF_USE_DEBUGPRINTF ) && FUNCONF_USE_DEBUGPRINTF
void handle_debug_input( int numbytes, uint8_t * data ) // You can override this!
void poll_input( void )
int _write(int fd, const char *buf, int size)
int putchar(int c)
void SetupDebugPrintf( void )
void WaitForDebuggerToAttach()
#endif

#if (defined( FUNCONF_USE_DEBUGPRINTF ) && !FUNCONF_USE_DEBUGPRINTF) && \
    (defined( FUNCONF_USE_UARTPRINTF ) && !FUNCONF_USE_UARTPRINTF) && \
    (defined( FUNCONF_NULL_PRINTF ) && FUNCONF_NULL_PRINTF)

int _write(int fd, const char *buf, int size)
int putchar(int c)
#endif

void DelaySysTick( uint32_t n )
void SystemInit( void )

#ifdef CPLUSPLUS
extern void __cxa_pure_virtual()
void __libc_init_array(void)
#endif

*/

// We pre-define these, because if the user is (for some awful reason) using gcc-riscv64-linux-gnu with newlib, it will fail to compile if it janks up the stdio/string functions.
#define _SSP_STRING_H_
#define _SSP_STDIO_H_

#include <stdio.h>
#include <string.h>
#include <stdarg.h>
#include <limits.h>
#include <stdint.h>
#include <ch32fun.h>

#define WEAK __attribute__((weak))

WEAK int errno;

static int __puts_uart( char *s, int len, void *buf )
{
	(void)buf;

	_write( 0, s, len );
	return len;
}

WEAK int printf( const char* format, ... )
{
	va_list args;
	va_start( args, format );
	int ret_status = mini_vpprintf(__puts_uart, 0, format, args);
	va_end( args );
	return ret_status;
}

WEAK int vprintf(const char* format, va_list args)
{
	return mini_vpprintf(__puts_uart, 0, format, args);
}

WEAK int snprintf( char * buffer, unsigned int buffer_len, const char* format, ... )
{
	va_list args;
	va_start( args, format );
	int ret = mini_vsnprintf( buffer, buffer_len, format, args );
	va_end( args );
	return ret;
}

WEAK int sprintf( char * buffer, const char * format, ... )
{
	va_list args;
	va_start( args, format );
	int ret = mini_vsnprintf( buffer, INT_MAX, format, args );
	va_end( args );
	return ret;
}

/* Some stuff from MUSL


----------------------------------------------------------------------
Copyright © 2005-2020 Rich Felker, et al.

Permission is hereby granted, free of charge, to any person obtaining
a copy of this software and associated documentation files (the
"Software"), to deal in the Software without restriction, including
without limitation the rights to use, copy, modify, merge, publish,
distribute, sublicense, and/or sell copies of the Software, and to
permit persons to whom the Software is furnished to do so, subject to
the following conditions:

The above copyright notice and this permission notice shall be
included in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
----------------------------------------------------------------------

*/

/*
 * mbstate_t is an opaque object to keep conversion state, during multibyte
 * stream conversions.  The content must not be referenced by user programs.
 */

#define CURRENT_UTF8 0
#define IS_CODEUNIT(c) ((unsigned)(c)-0xdf80 < 0x80)
#define MB_CUR_MAX (CURRENT_UTF8 ? 4 : 1)

typedef void * mbstate_t;

#ifdef UNICODE
WEAK size_t wcrtomb(char *restrict s, wchar_t wc, mbstate_t *restrict st)
{
	if (!s) return 1;
	if ((unsigned)wc < 0x80) {
		*s = wc;
		return 1;
	} else if (MB_CUR_MAX == 1) {
		if (!IS_CODEUNIT(wc)) {
			errno = 0x02; // EILSEQ
			return -1;
		}
		*s = wc;
		return 1;
	} else if ((unsigned)wc < 0x800) {
		*s++ = 0xc0 | (wc>>6);
		*s = 0x80 | (wc&0x3f);
		return 2;
	} else if ((unsigned)wc < 0xd800 || (unsigned)wc-0xe000 < 0x2000) {
		*s++ = 0xe0 | (wc>>12);
		*s++ = 0x80 | ((wc>>6)&0x3f);
		*s = 0x80 | (wc&0x3f);
		return 3;
	} else if ((unsigned)wc-0x10000 < 0x100000) {
		*s++ = 0xf0 | (wc>>18);
		*s++ = 0x80 | ((wc>>12)&0x3f);
		*s++ = 0x80 | ((wc>>6)&0x3f);
		*s = 0x80 | (wc&0x3f);
		return 4;
	}
	errno = 0x02;//EILSEQ;
	return -1;
}
WEAK int wctomb(char *s, wchar_t wc)
{
	if (!s) return 0;
	return wcrtomb(s, wc, 0);
}
#endif
WEAK size_t strlen(const char *s)
{
	const char *a = s;
	for (; *s; s++);
	return s-a;
}
WEAK size_t strnlen(const char *s, size_t n) { const char *p = memchr(s, 0, n); return p ? (size_t)(p-s) : n;}
WEAK void *memset(void *dest, int c, size_t n) { unsigned char *s = dest; for (; n; n--, s++) *s = c; return dest; }
WEAK char *strcpy(char *d, const char *s)
{
	char *d0=d;
	for (; (*d=*s); s++, d++);
	return d0;
}
WEAK char *strncpy(char *d, const char *s, size_t n)
{
	char *d0=d;
	for (; n && (*d=*s); n--, s++, d++);
	return d0;
}
WEAK int strcmp(const char *l, const char *r)
{
	for (; *l==*r && *l; l++, r++);
	return *(unsigned char *)l - *(unsigned char *)r;
}
WEAK int strncmp(const char *_l, const char *_r, size_t n)
{
	const unsigned char *l=(void *)_l, *r=(void *)_r;
	if (!n--) return 0;
	for (; *l && *r && n && *l == *r ; l++, r++, n--);
	return *l - *r;
}

static char *twobyte_strstr(const unsigned char *h, const unsigned char *n)
{
	uint16_t nw = n[0]<<8 | n[1], hw = h[0]<<8 | h[1];
	for (h++; *h && hw != nw; hw = hw<<8 | *++h);
	return *h ? (char *)h-1 : 0;
}

static char *threebyte_strstr(const unsigned char *h, const unsigned char *n)
{
	uint32_t nw = (uint32_t)n[0]<<24 | n[1]<<16 | n[2]<<8;
	uint32_t hw = (uint32_t)h[0]<<24 | h[1]<<16 | h[2]<<8;
	for (h+=2; *h && hw != nw; hw = (hw|*++h)<<8);
	return *h ? (char *)h-2 : 0;
}

static char *fourbyte_strstr(const unsigned char *h, const unsigned char *n)
{
	uint32_t nw = (uint32_t)n[0]<<24 | n[1]<<16 | n[2]<<8 | n[3];
	uint32_t hw = (uint32_t)h[0]<<24 | h[1]<<16 | h[2]<<8 | h[3];
	for (h+=3; *h && hw != nw; hw = hw<<8 | *++h);
	return *h ? (char *)h-3 : 0;
}

#define MAX(a,b) ((a)>(b)?(a):(b))
#define MIN(a,b) ((a)<(b)?(a):(b))

