cnlohr/ch32v003fun/ch32fun/ch32fun.c
void InterruptVector()         __attribute__((naked)) __attribute((section(".init"))) __attribute((weak,alias("InterruptVectorDefault"))) __attribute((naked));
void InterruptVectorDefault()  __attribute__((naked)) __attribute((section(".init"))) __attribute((naked));
void handle_reset( void ) __attribute__((section(".text.handle_reset")));

void InterruptVectorDefault( void )
{
#if !defined(FUNCONF_TINYVECTOR) || !FUNCONF_TINYVECTOR
	asm volatile( DEFAULT_INTERRUPT_VECTOR_CONTENTS );
#else
	asm volatile( "\n\
	.align  2\n\
	.option   push;\n\
	.option   norvc;\n\
	j handle_reset\n\
	.option   pop;\n" );
#endif
}

#if defined( CH32V003 ) || defined( CH32X03x )

void handle_reset( void )
{
	asm volatile( "\n\
.option push\n\
.option norelax\n\
	la gp, __global_pointer$\n\
.option pop\n\
	la sp, _eusrstack\n"
#if __GNUC__ > 10
".option arch, +zicsr\n"
#endif
	// Setup the interrupt vector, processor status and INTSYSCR.

#if FUNCONF_ENABLE_HPE	// Enabled nested and hardware (HPE) stack, since it's really good on the x035.
"	li t0, 0x88\n\
	csrs mstatus, t0\n"
"	li t0, 0x0b\n\
	csrw 0x804, t0\n"
#else
"	li a0, 0x80\n\
	csrw mstatus, a0\n"
#endif
"	li a3, 0x3\n\
	la a0, InterruptVector\n\
	or a0, a0, a3\n\
	csrw mtvec, a0\n" 
	: : : "a0", "a3", "memory");

	// Careful: Use registers to prevent overwriting of self-data.
	// This clears out BSS.
asm volatile(
"	la a0, _sbss\n\
	la a1, _ebss\n\
	li a2, 0\n\
	bge a0, a1, 2f\n\
1:	sw a2, 0(a0)\n\
	addi a0, a0, 4\n\
	blt a0, a1, 1b\n\
2:"
	// This loads DATA from FLASH to RAM.
"	la a0, _data_lma\n\
	la a1, _data_vma\n\
	la a2, _edata\n\
1:	beq a1, a2, 2f\n\
	lw a3, 0(a0)\n\
	sw a3, 0(a1)\n\
	addi a0, a0, 4\n\
	addi a1, a1, 4\n\
	bne a1, a2, 1b\n\
2:\n"
#ifdef CPLUSPLUS
	// Call __libc_init_array function
"	call %0 \n\t"
: : "i" (__libc_init_array) 
: "a0", "a1", "a2", "a3", "a4", "a5", "t0", "t1", "t2", "memory"
#else
: : : "a0", "a1", "a2", "a3", "memory"
#endif
);

#if defined( FUNCONF_SYSTICK_USE_HCLK ) && FUNCONF_SYSTICK_USE_HCLK
	SysTick->CTLR = 5;
#else
	SysTick->CTLR = 1;
#endif

	// set mepc to be main as the root app.
asm volatile(
"	csrw mepc, %[main]\n"
"	mret\n" : : [main]"r"(main) );
}

#elif defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)

void handle_reset( void )
{
	asm volatile( "\n\
.option push\n\
.option norelax\n\
	la gp, __global_pointer$\n\
.option pop\n\
	la sp, _eusrstack\n"
#if __GNUC__ > 10
  ".option arch, +zicsr\n"
#endif
			);

	// Careful: Use registers to prevent overwriting of self-data.
	// This clears out BSS.
	asm volatile(
"	la a0, _sbss\n\
	la a1, _ebss\n\
	bgeu a0, a1, 2f\n\
1:	sw zero, 0(a0)\n\
	addi a0, a0, 4\n\
	bltu a0, a1, 1b\n\
2:"
	// This loads DATA from FLASH to RAM.
"	la a0, _data_lma\n\
	la a1, _data_vma\n\
	la a2, _edata\n\
	beq a1, a2, 2f\n\
1:	lw t0, 0(a0)\n\
	sw t0, 0(a1)\n\
	addi a0, a0, 4\n\
	addi a1, a1, 4\n\
	bltu a1, a2, 1b\n\
2:\n"
#ifdef CPLUSPLUS
	// Call __libc_init_array function
"	call %0 \n\t"
: : "i" (__libc_init_array)
#else
: :
#endif
: "a0", "a1", "a2", "a3", "memory"
);

	// Setup the interrupt vector, processor status and INTSYSCR.
	asm volatile(
"	li t0, 0x1f\n\
	csrw 0xbc0, t0\n"

#if defined(CH32V30x) && !defined( DISABLED_FLOAT )
"	li t0, 0x6088\n\
	csrs mstatus, t0\n"
#else
"	li t0, 0x88\n\
	csrs mstatus, t0\n"
#endif

#if FUNCONF_ENABLE_HPE	// Enabled nested and hardware (HPE) stack, since it's really good on the x035.
"	li t0, 0x0b\n\
	csrw 0x804, t0\n"
#endif
"	la t0, InterruptVector\n\
	ori t0, t0, 3\n\
	csrw mtvec, t0\n"
	: : [InterruptVector]"r"(InterruptVector) : "t0", "memory"
	);

#if defined( FUNCONF_SYSTICK_USE_HCLK ) && FUNCONF_SYSTICK_USE_HCLK && !defined(CH32V10x)
	SysTick->CTLR = 5;
#else
	SysTick->CTLR = 1;
#endif

	// set mepc to be main as the root app.
	asm volatile(
"	csrw mepc, %[main]\n"
"	mret\n" : : [main]"r"(main) );
}

#endif

#if defined( __riscv_float_abi_double )
#define FLOAD( src, offset, dst ) \
"	fld " #src ", " #offset "*8(" #dst ")\n"
#define FSTORE( dst, offset, src ) \
"	fsd " #dst ", " #offset "*8(" #src ")\n"
#elif defined( __riscv_float_abi_single )
#define FLOAD( src, offset, dst ) \
"	flw " #src ", " #offset "*4(" #dst ")\n"
#define FSTORE( dst, offset, src ) \
"	fsw " #dst ", " #offset "*4(" #src ")\n"
#else // Soft float
#endif

__attribute__ ((naked)) int setjmp( jmp_buf env )
{
	asm volatile(
	// Common registers
"	sw ra, 0*4(a0)\n"
"	sw s0, 1*4(a0)\n"
"	sw s1, 2*4(a0)\n"
"	sw sp, 3*4(a0)\n"

    // RV32I only registers
#if !defined( __riscv_abi_rve )
"	sw s2, 4*4(a0)\n"
"	sw s3, 5*4(a0)\n"
"	sw s4, 6*4(a0)\n"
"	sw s5, 7*4(a0)\n"
"	sw s6, 8*4(a0)\n"
"	sw s7, 9*4(a0)\n"
"	sw s8, 10*4(a0)\n"
"	sw s9, 11*4(a0)\n"
"	sw s10, 12*4(a0)\n"
"	sw s11, 13*4(a0)\n"
#endif

	// FPU registers
#if defined( FSTORE )
	FSTORE(fs2, 14, a0)
	FSTORE(fs3, 15, a0)
	FSTORE(fs4, 16, a0)
	FSTORE(fs5, 17, a0)
	FSTORE(fs6, 18, a0)
	FSTORE(fs7, 19, a0)
	FSTORE(fs8, 20, a0)
	FSTORE(fs9, 21, a0)
	FSTORE(fs10, 22, a0)
	FSTORE(fs11, 23, a0)
#endif

"	li a0, 0\n"
"	ret\n"
	);
}

__attribute__ ((naked)) void longjmp( jmp_buf env, int val )
{
    asm volatile(
    // Common registers
"	lw ra, 0*4(a0)\n"
"	lw s0, 1*4(a0)\n"
"	lw s1, 2*4(a0)\n"
"	lw sp, 3*4(a0)\n"

    // RV32I only registers
#if !defined( __riscv_abi_rve )
"	lw s2, 4*4(a0)\n"
"	lw s3, 5*4(a0)\n"
"	lw s4, 6*4(a0)\n"
"	lw s5, 7*4(a0)\n"
"	lw s6, 8*4(a0)\n"
"	lw s7, 9*4(a0)\n"
"	lw s8, 10*4(a0)\n"
"	lw s9, 11*4(a0)\n"
"	lw s10, 12*4(a0)\n"
"	lw s11, 13*4(a0)\n"
#endif

	// FPU registers
#if defined( FLOAD )
	FLOAD(fs2, 14, a0)
	FLOAD(fs3, 15, a0)
	FLOAD(fs4, 16, a0)
	FLOAD(fs5, 17, a0)
	FLOAD(fs6, 18, a0)
	FLOAD(fs7, 19, a0)
	FLOAD(fs8, 20, a0)
	FLOAD(fs9, 21, a0)
	FLOAD(fs10, 22, a0)
	FLOAD(fs11, 23, a0)
#endif

"	seqz a0, a1\n" // a0 = (a1 == 0) ? 1 : 0
"	add a0, a0, a1\n"
"	ret\n"
	);
	__builtin_unreachable(); // Disable warning about no return.
}

#if defined( FUNCONF_USE_UARTPRINTF ) && FUNCONF_USE_UARTPRINTF
void SetupUART( int uartBRR )
{
#ifdef CH32V003
	// Enable GPIOD and UART.
	RCC->APB2PCENR |= RCC_APB2Periph_GPIOD | RCC_APB2Periph_USART1;

